In [2]:
import pandas as pd
df = pd.DataFrame(
    {
        "PassengerID" : [0, 1, 2, 3, 4],
        "Survived" : [0, 1, 1, 1, 0],
        "PClass" : [3, 1, 3, 1, 3],
        "Fare" : [7.2500, 71.2833, 7.9250, 53.1000, 80500],
        "Cabin" : [None, 85, None, 123,None],
        "Embarked" : ["S","C","S","S","S"],
        "Age" : [5,3,10,20,40],
        "Name" : ["João", "Enzo", "Guilherme", "Augusto", "José"]
    })

In [3]:
df.head()

   PassengerID  Survived  PClass        Fare  Cabin Embarked  Age       Name
0            0         0       3      7.2500    NaN        S    5       João
1            1         1       1     71.2833   85.0        C    3       Enzo
2            2         1       3      7.9250    NaN        S   10  Guilherme
3            3         1       1     53.1000  123.0        S   20    Augusto
4            4         0       3  80500.0000    NaN        S   40       José

In [20]:
print(df.loc[0,"Name"])

João